USE CarMarketDB;
GO


INSERT INTO Province (name) VALUES 
    (N'آذربایجان شرقی'),
    (N'آذربایجان غربی'),
    (N'اردبیل'),
    (N'اصفهان'),
    (N'البرز'),
    (N'ایلام'),
    (N'بوشهر'),
    (N'تهران'),
    (N'چهارمحال و بختیاری'),
    (N'خراسان جنوبی'),
    (N'خراسان رضوی'),
    (N'خراسان شمالی'),
    (N'خوزستان'),
    (N'زنجان'),
    (N'سمنان'),
    (N'سیستان و بلوچستان'),
    (N'فارس'),
    (N'قزوین'),
    (N'قم'),
    (N'کردستان'),
    (N'کرمان'),
    (N'کرمانشاه'),
    (N'کهگیلویه و بویراحمد'),
    (N'گلستان'),
    (N'گیلان'),
    (N'لرستان'),
    (N'مازندران'),
    (N'مرکزی'),
    (N'هرمزگان'),
    (N'همدان'),
    (N'یزد');
GO

INSERT INTO City (province_id, name) VALUES
-- آذربایجان شرقی
(1, N'تبریز'),
(1, N'مراغه'),
(1, N'مرند'),
(1, N'اهر'),

-- آذربایجان غربی
(2, N'ارومیه'),
(2, N'خوی'),
(2, N'بوکان'),
(2, N'مهاباد'),

-- اردبیل
(3, N'اردبیل'),
(3, N'پارس‌آباد'),
(3, N'مشگین‌شهر'),
(3, N'سرعین'),
(3, N'نیر'),

-- اصفهان
(4, N'اصفهان'),
(4, N'کاشان'),
(4, N'نجف‌آباد'),
(4, N'خمینی‌شهر'),
(4, N'شهرضا'),

-- البرز
(5, N'کرج'),
(5, N'نظرآباد'),
(5, N'هشتگرد'),

-- ایلام
(6, N'ایلام'),
(6, N'دهلران'),

-- بوشهر 
(7, N'بوشهر'),
(7, N'برازجان'),
(7, N'جم'),

-- تهران 
(8, N'تهران'),
(8, N'شهریار'),
(8, N'اسلامشهر'),
(8, N'ورامین'),
(8, N'ری'),
(8, N'قدس'),
(8, N'ملارد'),
(8, N'رودهن'),

-- چهارمحال و بختیاری 
(9, N'شهرکرد'),
(9, N'بروجن'),

-- خراسان جنوبی
(10, N'بیرجند'),
(10, N'قائن'),
(10, N'طبس'),

-- خراسان رضوی
(11, N'مشهد'),
(11, N'نیشابور'),
(11, N'سبزوار'),
(11, N'تربت حیدریه'),
(11, N'کاشمر'),
(11, N'گناباد'),
(11, N'چناران'),

-- خراسان شمالی 
(12, N'بجنورد'),
(12, N'شیروان'),
(12, N'اسفراین'),

-- خوزستان 
(13, N'اهواز'),
(13, N'دزفول'),
(13, N'آبادان'),
(13, N'خرمشهر'),
(13, N'مسجدسلیمان'),
(13, N'بهبهان'),

-- زنجان
(14, N'زنجان'),
(14, N'ابهر'),
(14, N'خرمدره'),

-- سمنان 
(15, N'سمنان'),
(15, N'شاهرود'),
(15, N'دامغان'),
(15, N'گرمسار'),

-- سیستان و بلوچستان
(16, N'زاهدان'),
(16, N'چابهار'),
(16, N'زابل'),
(16, N'ایرانشهر'),

-- فارس 
(17, N'شیراز'),
(17, N'مرودشت'),
(17, N'کازرون'),
(17, N'لار'),
(17, N'جهرم'),
(17, N'فسا'),

-- قزوین
(18, N'قزوین'),
(18, N'تاکستان'),

-- قم 
(19, N'قم'),

-- کردستان 
(20, N'سنندج'),
(20, N'سقز'),
(20, N'مریوان'),

-- کرمان
(21, N'کرمان'),
(21, N'رفسنجان'),
(21, N'جیرفت'),
(21, N'سیرجان'),

-- کرمانشاه
(22, N'کرمانشاه'),
(22, N'اسلام‌آباد غرب'),
(22, N'هرسین'),

-- کهگیلویه و بویراحمد
(23, N'یاسوج'),
(23, N'گچساران'),
(23, N'دوگنبدان'),

-- گلستان 
(24, N'گرگان'),
(24, N'گنبد کاووس'),
(24, N'علی‌آباد کتول'),

-- گیلان 
(25, N'رشت'),
(25, N'انزلی'),
(25, N'لاهیجان'),
(25, N'آستارا'),

-- لرستان 
(26, N'خرم‌آباد'),
(26, N'بروجرد'),
(26, N'دورود'),

-- مازندران 
(27, N'ساری'),
(27, N'بابل'),
(27, N'آمل'),
(27, N'قائم‌شهر'),
(27, N'نوشهر'),
(27, N'چالوس'),
(27, N'رامسر'),

-- مرکزی 
(28, N'اراک'),
(28, N'ساوه'),
(28, N'خمین'),

-- هرمزگان 
(29, N'بندرعباس'),
(29, N'قشم'),
(29, N'کیش'),
(29, N'بندرلنگه'),

-- همدان 
(30, N'همدان'),
(30, N'ملایر'),
(30, N'نهاوند'),

-- یزد 
(31, N'یزد'),
(31, N'میبد'),
(31, N'اردکان');
GO



INSERT INTO Brand (name, country) VALUES
(N'ایران خودرو', N'ایران'),
(N'سایپا', N'ایران'),
(N'بهمن', N'ایران'),
(N'مدیریت خودرو', N'ایران'),
(N'رامین', N'ایران'),
(N'کیان موتور', N'ایران'),
(N'آرین موتور', N'ایران'),

(N'تویوتا', N'ژاپن'),
(N'هوندا', N'ژاپن'), 
(N'نیسان', N'ژاپن'),
(N'مزدا', N'ژاپن'),
(N'سوزوکی', N'ژاپن'), 
(N'میتسوبیشی', N'ژاپن'),
(N'لکسوس', N'ژاپن'),
(N'سوبارو', N'ژاپن'),

(N'هیوندای', N'کره جنوبی'),
(N'کیا', N'کره جنوبی'),

(N'چری', N'چین'),
(N'ام‌وی‌ام', N'چین'),
(N'لیفان', N'چین'),
(N'جیلی', N'چین'),
(N'هایما', N'چین'),
(N'برلیانس', N'چین'),
(N'دانگ فنگ', N'چین'),
(N'فوتون', N'چین'), 
(N'جک', N'چین'),
(N'بایک', N'چین'),

(N'بنز', N'آلمان'), 
(N'BMW', N'آلمان'), 
(N'آئودی', N'آلمان'),
(N'فولکس واگن', N'آلمان'),
(N'پورشه', N'آلمان'),
(N'اوپل', N'آلمان'),
(N'من', N'آلمان'),

(N'فورد', N'آمریکا'),
(N'شورولت', N'آمریکا'),
(N'جیپ', N'آمریکا'),
(N'دوج', N'آمریکا'), 

(N'رنو', N'فرانسه'), 
(N'پژو', N'فرانسه'),
(N'سیتروئن', N'فرانسه'),

(N'فیات', N'ایتالیا'),
(N'ایوکو', N'ایتالیا'), 

(N'رنج‌روور', N'انگلستان'),
(N'جگوار', N'انگلستان'),

(N'اسکانیا', N'سوئد'), 
(N'ولوو', N'سوئد'), 
(N'داچیا', N'رومانی'); 
GO


